Masmiseim36/nxpSDK/middleware/mcu-boot/targets/MIMXRT1176/src/flexspi_config_MIMXRT1176.c
/*
 * Copyright 2018 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */
#include "bl_flexspi.h"
#include "flexspi_nor_flash.h"
#include "fsl_clock.h"
#include "fsl_device_registers.h"
#include "fusemap.h"
#include "microseconds.h"
#include "peripherals_pinmux.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/
#define FREQ_396MHz (396000000U)
#define FREQ_480MHz (480000000U)
#define FREQ_528MHz (528000000U)
#define FREQ_24MHz (24000000U)
#define FREQ_1MHz (1000000U)

//!@brief OTFAD related bitmask
#define IOMUXC_GPR34_OTFAD1_EN_MASK (1u << 1)
#define IOMUXC_GPR35_OTFAD2_EN_MASK (1u << 1)

#define FLEXSPI_REMAP_ADDR_UNIT_IN_BYTES (4096ul)

//!@brief Address remap related defintions
typedef struct
{
    __IO uint32_t START;
    __IO uint32_t END;
    __IO uint32_t OFFSET;
} FLEXSPI_ADDR_REMAP_Type;

enum
{
    kImageSize_SecImageOffset = 0, // Image Size = Secondary Image Offset
    kImageSize_1MB = 1,
    kImageSize_2MB = 2,
    kImageSize_3MB = 3,
    kImageSize_4MB = 4,
    kImageSiz_5MB = 5,
    kImageSiz_6MB = 6,
    kImageSiz_7MB = 7,
    kImageSiz_8MB = 8,
    kImageSiz_9MB = 9,
    kImageSiz_10MB = 10,
    kImageSiz_11MB = 11,
    kImageSiz_12MB = 12,
    kImageSize_256KB = 13,
    kImageSize_512KB = 14,
    kImageSize_768KB = 15,
};

enum
{
    kFlashSize_1KB = 1024u,
    kFlashSize_256KB = 256 * kFlashSize_1KB,
    kFlashSize_1MB = (1024 * kFlashSize_1KB),
};

enum
{
    kHoldTime_500US = 0,
    kHoldTime_1MS = 1,
    kHoldTime_3MS = 2,
    kHoldTime_10MS = 3,
};

//!@brief FLEXSPI ROOT CLOCK soruce related definitions
enum
{
    kFlexSpiClkSrc_RC48M_Div2 = 0,
    kFlexSpiClkSrc_OSC = 1,
    kFlexSpiClkSrc_RC400M = 2,
    kFlexSpiClkSrc_RC4M_16M = 3,
    kFlexSpiClkSrc_PLL_480_PFD0 = 4,
    kFlexSpiClkSrc_PLL_528 = 5,
    kFlexSpiClkSrc_PLL_528_PFD2 = 6,
    kFlexSpiClkSrc_PLL_480 = 7,
};

enum
{
    kFlexSpiClkFreqSrc_Normal = 0,
    kFlexSpiClkFreqSrc_RC400M = 1,
    kFlexSpiClkFreqSrc_PLL480M = 2,
};

enum
{
    kFlashResetLogic_Disabled = 0,
    kFlashResetLogic_ResetPin = 1,
    kFlashResetLogic_JedecHwReset = 2,
};

typedef struct
{
    uint8_t muxPadIndex;       // Index in IOMUXC_MUX_CTL and IOMUXC_PAD_CTL , 0 means this feature is not supported
    uint8_t muxValue;          // MUX value of Pin
    uint8_t selectInputIndex;  // index in IOMUXC_SELECT_INPUT, 0 means this feature is not supported
    uint8_t selecctInputValue; // Selece Input value
} flexspi_pad_attribute_t;

typedef struct
{
    flexspi_pad_attribute_t A_SS0;
    flexspi_pad_attribute_t A_SS1;
    flexspi_pad_attribute_t A_SCLK;
    flexspi_pad_attribute_t A_SCLKB;
    flexspi_pad_attribute_t A_DQS;
    flexspi_pad_attribute_t A_DATA[8];
    flexspi_pad_attribute_t B_SS0;
    flexspi_pad_attribute_t B_SS1;
    flexspi_pad_attribute_t B_SCLK;
    flexspi_pad_attribute_t B_SCLKB;
    flexspi_pad_attribute_t B_DQS;
    flexspi_pad_attribute_t B_DATA[8];
    uint32_t csPadSetting;
    uint32_t sclkPadSetting;
    uint32_t dataPadSetting;
    uint32_t dqsPadSetting;
} flexspi_pad_data_t;

enum
{
    kFlexspiPadDataIndex_FlexSpi1_Primary = 0,
    kFlexspiPadDataIndex_FlexSpi1_Secondary = 1,
    kFlexspiPadDataIndex_FlexSpi2_Primary = 2,
    kFlexspiPadDataIndex_FlexSpi2_Secondary = 3,
    kFlexspiPadDataIndex_Max,
};

typedef struct
{
    uint32_t muxPadIndex;
    uint32_t muxValue;
    GPIO_Type *gpio;
    uint32_t pinIndex;
} gpio_pad_data_t;

typedef struct
{
    gpio_pad_data_t SS0;
    gpio_pad_data_t SCLK;
    gpio_pad_data_t SIN;
} flash_jedec_hw_pin_t;

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
static void flexspi_nor_jedec_hw_reset(uint32_t instance);
static void flexspi_jedec_hw_reset(volatile GPIO_Type *gpio, uint32_t cs_pin, uint32_t clk_pin, uint32_t sin_pin);
static bool is_flexspi_clock_enabled(uint32_t instance);

/*******************************************************************************
 * Variables
 ******************************************************************************/
// Secondary option of the DQS pin for Primary FLEXSPI1 Pin group
const flexspi_pad_attribute_t k_flexspi1_A_DQS3 = { kIOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_18, 6,
                                                    kIOMUXC_FLEXSPI1_I_DQS_FA_SELECT_INPUT, 0 };
// Reset Pin Definitions
const gpio_pad_data_t k_resetPins[2] = {
    { SW_MUX_CTL_PAD_FLEXSPI_RESET_IDX, FLEXSPI_RESET_PIN_MUX, FLEXSPI_RESET_PIN_GPIO, FLEXSPI_RESET_PIN_INDEX },
    { SW_MUX_CTL_PAD_FLEXSPI_SEC_RESET_IDX, FLEXSPI_RESET_SEC_PIN_MUX, FLEXSPI_RESET_SEC_PIN_GPIO,
      FLEXSPI_RESET_SEC_PIN_INDEX },
};

// JEDEC HW Reset Pin Group
const flash_jedec_hw_pin_t k_jedecHwResetPins[4] = {
    // FLEXSPI1A
    {
        .SS0 = { SW_MUX_CTL_PAD_FLEXSPI1A_SS0_B_IDX, 5, GPIO4, 15 },
        .SCLK = { SW_MUX_CTL_PAD_FLEXSPI1A_SCLK_IDX, 5, GPIO4, 16 },
        .SIN = { SW_MUX_CTL_PAD_FLEXSPI1A_DATA0_IDX, 5, GPIO4, 17 },
    },
    // FLEXSPI1A_SEC
    {
        .SS0 = { SW_MUX_CTL_PAD_FLEXSPI1A_SEC_SS0_B_IDX, 5, GPIO3, 17 },
        .SCLK = { SW_MUX_CTL_PAD_FLEXSPI1A_SEC_SCLK_IDX, 5, GPIO3, 18 },
        .SIN = { SW_MUX_CTL_PAD_FLEXSPI1A_SEC_DATA0_IDX, 5, GPIO3, 19 },
    },
    // FLEXSPI2A
    {
        .SS0 = { SW_MUX_CTL_PAD_FLEXSPI2A_SS0_B_IDX, 5, GPIO2, 22 },
        .SCLK = { SW_MUX_CTL_PAD_FLEXSPI2A_SCLK_IDX, 5, GPIO2, 20 },
        .SIN = { SW_MUX_CTL_PAD_FLEXSPI2A_DATA0_IDX, 5, GPIO2, 23 },
    },
    // FLEXSPI2A_SEC
    {
        .SS0 = { SW_MUX_CTL_PAD_FLEXSPI2A_SEC_SS0_B_IDX, 5, GPIO4, 3 },
        .SCLK = { SW_MUX_CTL_PAD_FLEXSPI2A_SEC_SCLK_IDX, 5, GPIO4, 4 },
        .SIN = { SW_MUX_CTL_PAD_FLEXSPI2A_SEC_DATA0_IDX, 5, GPIO4, 5 },
    },
};

// FlexSPI NOR Pin setting list
const flexspi_pad_data_t k_flexspi_pads[kFlexspiPadDataIndex_Max] = {
    // FLEXSPI1 PRIMARY
    {
        .A_SS0 = { SW_PAD_CTL_PAD_FLEXSPI1A_SS0_B_IDX, 1, 0, 0 },
        .A_SS1 = { SW_PAD_CTL_PAD_FLEXSPI1A_SS1_B_IDX, 9, 0, 0 },
        .A_SCLK = { SW_PAD_CTL_PAD_FLEXSPI1A_SCLK_IDX, 1, kIOMUXC_FLEXSPI1_I_SCK_FA_SELECT_INPUT, 1 },
        .A_SCLKB = { SW_PAD_CTL_PAD_FLEXSPI1A_SCLK_B_IDX, 1, kIOMUXC_FLEXSPI1_I_SCK_FB_SELECT_INPUT, 1 },
        .A_DQS = { SW_MUX_CTL_PAD_FLEXSPI1A_DQS_IDX, 1, kIOMUXC_FLEXSPI1_I_DQS_FA_SELECT_INPUT, 2 },
        .A_DATA =
            {
                // 0
                { SW_PAD_CTL_PAD_FLEXSPI1A_DATA0_IDX, 1, kIOMUXC_FLEXSPI1_I_IO_FA_SELECT_INPUT_0, 1 },
                // 1
                { SW_PAD_CTL_PAD_FLEXSPI1A_DATA1_IDX, 1, kIOMUXC_FLEXSPI1_I_IO_FA_SELECT_INPUT_1, 1 },
                // 2
                { SW_PAD_CTL_PAD_FLEXSPI1A_DATA2_IDX, 1, kIOMUXC_FLEXSPI1_I_IO_FA_SELECT_INPUT_2, 1 },
                // 3
                { SW_PAD_CTL_PAD_FLEXSPI1A_DATA3_IDX, 1, kIOMUXC_FLEXSPI1_I_IO_FA_SELECT_INPUT_3, 1 },
                // 4
                { SW_PAD_CTL_PAD_FLEXSPI1B_DATA0_IDX, 1, kIOMUXC_FLEXSPI1_I_IO_FB_SELECT_INPUT_0, 1 },
                // 5
                { SW_PAD_CTL_PAD_FLEXSPI1B_DATA1_IDX, 1, kIOMUXC_FLEXSPI1_I_IO_FB_SELECT_INPUT_1, 1 },
                // 6
                { SW_PAD_CTL_PAD_FLEXSPI1B_DATA2_IDX, 1, kIOMUXC_FLEXSPI1_I_IO_FB_SELECT_INPUT_2, 1 },
                // 7
                { SW_PAD_CTL_PAD_FLEXSPI1B_DATA3_IDX, 1, kIOMUXC_FLEXSPI1_I_IO_FB_SELECT_INPUT_3, 1 },
            },
        .B_SS0 = { SW_MUX_CTL_PAD_FLEXSPI1B_SS0_B_IDX, 8, 0, 0 },
        .B_SS1 = { SW_MUX_CTL_PAD_FLEXSPI1B_SS1_B_IDX, 9, 0, 0 },
        .B_SCLK = { SW_MUX_CTL_PAD_FLEXSPI1B_SCLK_IDX, 1, kIOMUXC_FLEXSPI1_I_SCK_FB_SELECT_INPUT, 1 },
        .B_DQS = { SW_MUX_CTL_PAD_FLEXSPI1B_DQS_IDX, 8, 0, 0 },
        .B_DATA =
            {
                // 0
                { SW_PAD_CTL_PAD_FLEXSPI1B_DATA0_IDX, 1, kIOMUXC_FLEXSPI1_I_IO_FB_SELECT_INPUT_0, 1 },
                // 1
                { SW_PAD_CTL_PAD_FLEXSPI1B_DATA1_IDX, 1, kIOMUXC_FLEXSPI1_I_IO_FB_SELECT_INPUT_1, 1 },
                // 2
                { SW_PAD_CTL_PAD_FLEXSPI1B_DATA2_IDX, 1, kIOMUXC_FLEXSPI1_I_IO_FB_SELECT_INPUT_2, 1 },
                // 3
                { SW_PAD_CTL_PAD_FLEXSPI1B_DATA3_IDX, 1, kIOMUXC_FLEXSPI1_I_IO_FB_SELECT_INPUT_3, 1 },
            },
        .csPadSetting = IOMUXC_SW_PAD_CTL_PAD_PULL(3),   // No-Pull
        .sclkPadSetting = IOMUXC_SW_PAD_CTL_PAD_PULL(3), // No-Pull
        .dataPadSetting = IOMUXC_SW_PAD_CTL_PAD_PULL(3), // No-Pull
        .dqsPadSetting = IOMUXC_SW_PAD_CTL_PAD_PULL(2),  // Pull down
    },
    // FLEXSPI1 SECONDARY
    {
        .A_SS0 = { SW_PAD_CTL_PAD_FLEXSPI1A_SEC_SS0_B_IDX, 3, 0, 0 },
        .A_SCLK = { SW_PAD_CTL_PAD_FLEXSPI1A_SEC_SCLK_IDX, 3, kIOMUXC_FLEXSPI1_I_SCK_FA_SELECT_INPUT, 0 },
        .A_SCLKB = { SW_PAD_CTL_PAD_FLEXSPI1B_SEC_SCLK_IDX, 3, kIOMUXC_FLEXSPI1_I_SCK_FB_SELECT_INPUT, 0 },
        .A_DQS = { SW_MUX_CTL_PAD_FLEXSPI1A_SEC_DQS_IDX, 3, kIOMUXC_FLEXSPI1_I_DQS_FA_SELECT_INPUT, 1 },
        .A_DATA =
            {
                // 0
                { SW_PAD_CTL_PAD_FLEXSPI1A_SEC_DATA0_IDX, 3, kIOMUXC_FLEXSPI1_I_IO_FA_SELECT_INPUT_0, 0 },
                // 1
                { SW_PAD_CTL_PAD_FLEXSPI1A_SEC_DATA1_IDX, 3, kIOMUXC_FLEXSPI1_I_IO_FA_SELECT_INPUT_1, 0 },
                // 2
                { SW_PAD_CTL_PAD_FLEXSPI1A_SEC_DATA2_IDX, 3, kIOMUXC_FLEXSPI1_I_IO_FA_SELECT_INPUT_2, 0 },
                // 3
                { SW_PAD_CTL_PAD_FLEXSPI1A_SEC_DATA3_IDX, 3, kIOMUXC_FLEXSPI1_I_IO_FA_SELECT_INPUT_3, 0 },
                // 4
                { SW_PAD_CTL_PAD_FLEXSPI1B_SEC_DATA0_IDX, 3, kIOMUXC_FLEXSPI1_I_IO_FB_SELECT_INPUT_0, 0 },
                // 5
                { SW_PAD_CTL_PAD_FLEXSPI1B_SEC_DATA1_IDX, 3, kIOMUXC_FLEXSPI1_I_IO_FB_SELECT_INPUT_1, 0 },
                // 6
                { SW_PAD_CTL_PAD_FLEXSPI1B_SEC_DATA2_IDX, 3, kIOMUXC_FLEXSPI1_I_IO_FB_SELECT_INPUT_2, 0 },
                // 7
                { SW_PAD_CTL_PAD_FLEXSPI1B_SEC_DATA3_IDX, 3, kIOMUXC_FLEXSPI1_I_IO_FB_SELECT_INPUT_3, 0 },
            },
        .csPadSetting = IOMUXC_SW_PAD_CTL_PAD_SRE(1) | IOMUXC_SW_PAD_CTL_PAD_DSE(1),   // No pull, fast drive
        .sclkPadSetting = IOMUXC_SW_PAD_CTL_PAD_SRE(1) | IOMUXC_SW_PAD_CTL_PAD_DSE(1), // No pull, fast drive
        .dataPadSetting = IOMUXC_SW_PAD_CTL_PAD_SRE(1) | IOMUXC_SW_PAD_CTL_PAD_DSE(1), // No pull, fast drive
        .dqsPadSetting = IOMUXC_SW_PAD_CTL_PAD_SRE(1) | IOMUXC_SW_PAD_CTL_PAD_DSE(1) |
                         IOMUXC_SW_PAD_CTL_PAD_PUE(1), // Pull down
    },
    // FLEXSPI2 PRIMARY
    {
        .A_SS0 = { SW_PAD_CTL_PAD_FLEXSPI2A_SS0_B_IDX, 4, 0, 0 },
        .A_SCLK = { SW_PAD_CTL_PAD_FLEXSPI2A_SCLK_IDX, 4, kIOMUXC_FLEXSPI2_I_SCK_FA_SELECT_INPUT, 0 },
        .A_SCLKB = { SW_PAD_CTL_PAD_FLEXSPI2A_SCLK_B_IDX, 4, 0, 0 },
        .A_DQS = { SW_MUX_CTL_PAD_FLEXSPI2A_DQS_IDX, 4, 0, 0 },
        .A_DATA =
            {
                // 0
                { SW_PAD_CTL_PAD_FLEXSPI2A_DATA0_IDX, 4, kIOMUXC_FLEXSPI2_I_IO_FA_SELECT_INPUT_0, 0 },
                // 1
                { SW_PAD_CTL_PAD_FLEXSPI2A_DATA1_IDX, 4, kIOMUXC_FLEXSPI2_I_IO_FA_SELECT_INPUT_1, 0 },
                // 2
                { SW_PAD_CTL_PAD_FLEXSPI2A_DATA2_IDX, 4, kIOMUXC_FLEXSPI2_I_IO_FA_SELECT_INPUT_2, 0 },
                // 3
                { SW_PAD_CTL_PAD_FLEXSPI2A_DATA3_IDX, 4, kIOMUXC_FLEXSPI2_I_IO_FA_SELECT_INPUT_3, 0 },
                // 4
                { SW_PAD_CTL_PAD_FLEXSPI2A_DATA4_IDX, 4, 0, 0 },
                // 5
                { SW_PAD_CTL_PAD_FLEXSPI2A_DATA5_IDX, 4, 0, 0 },
                // 6
                { SW_PAD_CTL_PAD_FLEXSPI2A_DATA6_IDX, 4, 0, 0 },
                // 7
                { SW_PAD_CTL_PAD_FLEXSPI2A_DATA7_IDX, 4, 0, 0 },
            },
        .B_SS0 = { SW_MUX_CTL_PAD_FLEXSPI2B_SS0_B_IDX, 4, 0, 0 },
        .B_SCLK = { SW_MUX_CTL_PAD_FLEXSPI2B_SCLK_IDX, 4, 0, 0 },
        .B_DQS = { SW_MUX_CTL_PAD_FLEXSPI2B_DQS_IDX, 4, 0, 0 },
        .B_DATA =
            {
                // 0
                { SW_PAD_CTL_PAD_FLEXSPI2B_DATA0_IDX, 4, 0, 0 },
                // 1
                { SW_PAD_CTL_PAD_FLEXSPI2B_DATA1_IDX, 4, 0, 0 },
                // 2
                { SW_PAD_CTL_PAD_FLEXSPI2B_DATA2_IDX, 4, 0, 0 },
                // 3
                { SW_PAD_CTL_PAD_FLEXSPI2B_DATA3_IDX, 4, 0, 0 },
                // 4
                { SW_PAD_CTL_PAD_FLEXSPI2B_DATA4_IDX, 4, 0, 0 },
                // 5
                { SW_PAD_CTL_PAD_FLEXSPI2B_DATA5_IDX, 4, 0, 0 },
                // 6
                { SW_PAD_CTL_PAD_FLEXSPI2B_DATA6_IDX, 4, 0, 0 },
                // 7
                { SW_PAD_CTL_PAD_FLEXSPI2B_DATA7_IDX, 4, 0, 0 },
            },
        .csPadSetting = IOMUXC_SW_PAD_CTL_PAD_PULL(3),   // No-pull
        .sclkPadSetting = IOMUXC_SW_PAD_CTL_PAD_PULL(3), // No-pull
        .dataPadSetting = IOMUXC_SW_PAD_CTL_PAD_PULL(3), // No-pull
        .dqsPadSetting = IOMUXC_SW_PAD_CTL_PAD_PULL(2),  // Pull down
    },
    // FLEXSPI2 SECONDARY
    {
        .A_SS0 = { SW_PAD_CTL_PAD_FLEXSPI2A_SEC_SS0_B_IDX, 6, 0, 0 },
        .A_SCLK = { SW_PAD_CTL_PAD_FLEXSPI2A_SEC_SCLK_IDX, 6, kIOMUXC_FLEXSPI2_I_SCK_FA_SELECT_INPUT, 1 },
        .A_DATA =
            {
                // 0
                { SW_PAD_CTL_PAD_FLEXSPI2A_SEC_DATA0_IDX, 6, kIOMUXC_FLEXSPI2_I_IO_FA_SELECT_INPUT_0, 1 },
                // 1
                { SW_PAD_CTL_PAD_FLEXSPI2A_SEC_DATA1_IDX, 6, kIOMUXC_FLEXSPI2_I_IO_FA_SELECT_INPUT_1, 1 },
                // 2
                { SW_PAD_CTL_PAD_FLEXSPI2A_SEC_DATA2_IDX, 6, kIOMUXC_FLEXSPI2_I_IO_FA_SELECT_INPUT_2, 1 },
                // 3
                { SW_PAD_CTL_PAD_FLEXSPI2A_SEC_DATA3_IDX, 6, kIOMUXC_FLEXSPI2_I_IO_FA_SELECT_INPUT_3, 1 },
            },
        .csPadSetting = IOMUXC_SW_PAD_CTL_PAD_PULL(3),   // No-pull
        .sclkPadSetting = IOMUXC_SW_PAD_CTL_PAD_PULL(3), // No-pull
        .dataPadSetting = IOMUXC_SW_PAD_CTL_PAD_PULL(3), // No-pull
        .dqsPadSetting = IOMUXC_SW_PAD_CTL_PAD_PULL(2),  // Pull down
    },
};

